<template>
  <v-layout column justify-center align-center>
    <v-flex xs12 sm8 md6>
      <h1>About me</h1>
      <h2>技術の勉強が好きということ</h2>
      <p>
        大学時代にたまたま見つけた「退屈なことはPythonにやらせよう」に出会って以来、独学でPythonを勉強し、コード自体は書いていたのですが、Web開発に関してはほとんど未経験で現在の会社に入社しました。現在の会社の研修で学んだWeb開発がとても面白いと感じ、業務外で様々なことを勉強してきました。
        主に勉強法としては技術書を読む、UdemyやCourseraといった動画形式で学ぶことのできるサービスを使ったり、気になる技術の勉強会などの集まりに顔を出したりしたりもしています。あと、勉強とは言わないかもしれませんが、技術系のPodcastを聴いて刺激を受けたりしています。
        また、インプットだけではなく、分からないことがあれば調べ、
        そしてQiitaなどでのアウトプットを含めて行うことで非常に定着率の高い勉強法を確立できています。
        気になる技術があった時には手を動かして実際に何かを作るということを大事にしており、このサイト以外にも趣味でフロントエンドをVue.js、バックエンドをPythonのWebフレームワークであるDjangoを組み合わせたWebアプリケーションを作成中です。
        現にこのサイトを作る際に使用したNuxt.jsとAzureに関しては
        <strong>
          初めて使用
        </strong>
        して作りましたし、様々な機会を使って新しい技術を勉強するのが楽しくてたまりません。
      </p>
      <hr class="my-3" />
      <h2>新しい仕事で興味があること</h2>
      <p>
        私は三つの欲求を大事にしています。まず第一に自身の担当するお客様に喜んでもらいたい、第二に日本の働き方を変える手助けをしたい、そして最後に先進的な技術のプロフェッショナルになりたい、という点です。
        まず一つ目の軸を持っている理由ですが、大学時代に営業の長期インターンを行っていた際に、お客様の求めている情報を提供したり、導入までの流れを全力でサポートをし、成約まで至ったお客様がいました。
        その方にあなたでよかったというお礼を言われたことに努力が報われた嬉しさと感謝された喜びにとても感動し、それ以来誰かの役に立ち、感謝されるくらい相手に尽くすということを大事にしています。
        第二の軸を持つ理由は、私がプログラミングを始めたきっかけである、「退屈なことはPythonにやらせよう」と大きな関係があります。私はこの本のとあるプログラムについてQiitaで記事を書き、書籍名+Qiitaで検索をすると私の記事が二番目に出てくるくらいで、とても好きな本です。
        この本では従来の作成方法だと多くの繰り返し作業をしなければならない物、例えばファイル管理などをPythonで書いたプログラムで自動化しよう、そして面倒なことから解放されようというコンセプトの本なのですが、この精神こそが私のエンジニアとしての根底にある物であり、IT業界にはこのような人が面倒臭いと感じるような事をシステムを使って解決していく、というところに惹かれてエンジニアとして現在の会社に入社しました。
        そして入社して受講した研修でクラウドという技術に触れた時に、その手軽さに衝撃を受け、自然とプライベートでも触るようになっていきました。それ以来、クラウド、とりわけ自身が触っていたPaaS領域についてのキャリアを歩みたいと考えるようになっていきました。
        そして第三の理由ですが、自身が新しい物好きなのもあり、日々急激に進歩している領域に興味があります。また、進歩している業界であれば自身が新しい技術の第一人者になれる可能性もあり、そういった所も非常に個人的に興味がある分野なので、現在は一つの領域に関してひたすら突き詰めていきたいと考えています。
      </p>
      <hr class="my-3" />
      <h2>将来的なキャリア</h2>
      <p>
        まず、技術に一生携わる事を前提にキャリアを描いています。
        ただ、マネジメントに興味がないわけではなく、将来的に機会があれば率先して引き受けたいと考えています。
        そして、英語を使って業務をすることに興味があり、社会人になってからも英語の勉強を続け、ブログに記事を書いたり、大学時代にTOEICのハイスコアを更新したりしました。
        これらは現在も技術の勉強と並行して行っており、英語が使える機会を作れる、もしくは使わざるを得ない環境に身をおきたいと強く考えています。
      </p>
      <div id="app">
        <v-app id="inspire">
          <div>
            <v-stepper non-linear value="1">
              <v-stepper-header>
                <nuxt-link to="/aboutme">
                  <v-stepper-step editable step="1">
                    About me
                  </v-stepper-step>
                </nuxt-link>
                <v-divider></v-divider>
                <nuxt-link to="/why">
                  <v-stepper-step editable step="2">
                    Why Microsoft?
                  </v-stepper-step>
                </nuxt-link>
                <v-divider></v-divider>
                <nuxt-link to="/contribute">
                  <v-stepper-step step="3" editable>
                    How to contribute
                  </v-stepper-step>
                </nuxt-link>
              </v-stepper-header>
            </v-stepper>
          </div>
        </v-app>
      </div>
    </v-flex>
  </v-layout>
</template>

<style>
h1 {
  text-align: center;
  padding: 20px;
}
h2 {
  text-align: center;
  padding: 5%;
}
p {
  padding: 10%;
}
</style>
